export const courses = [
  {
    id: "gwangalli",
    title: "🏃 광안리 해변",
    distance: "약 5km",
    points: [
      { label: "출발 - 민락수변공원 입구", lat: 35.1543, lng: 129.1309 },
      { label: "중간1 - 광안해변공원", lat: 35.1541, lng: 129.1235 },
      { label: "중간2 - 광안리해수욕장", lat: 35.1534, lng: 129.1186 },
      { label: "도착 - 삼익비치 수변공원", lat: 35.1462946, lng: 129.1146990 }
    ]
  },
  {
    id: "haeundae",
    title: "🏃 해운대 해변",
    distance: "약 5km",
    points: [
      { label: "출발 - 동백섬 산책로 시작점", lat: 35.1568, lng: 129.1530 },
      { label: "중간1 - 더베이101 앞 보행로", lat: 35.1558, lng: 129.1517 },
      { label: "중간2 - 해운대광장 앞 산책로", lat: 35.1587, lng: 129.1604 },
      { label: "도착 - 미포항 산책로 입구", lat: 35.1605, lng: 129.1740 }
    ]
  },
{
  id: "songjeong",
  title: "🏃 송정 해변",
  distance: "약 5km",
  points: [
    {
      label: "출발 - 송정해수욕장 입구",
      lat: 35.1815565,
      lng: 129.2056743
    },
    {
      label: "중간1 - 송정해수욕장 중앙",
      lat: 35.1803902,
      lng: 129.2018227
    },
    {
      label: "중간2 - 구덕포길",
      lat: 35.1718014,
      lng: 129.1977560
    },
    {
      label: "도착 - 청사포 다릿돌 전망대",
      lat: 35.1643026,
      lng: 129.1962003
    }
  ]
},
{
  id: "dadaepo",
  title: "🏃 다대포 해변",
  distance: "약 5km",
  points: [
    {
      label: "출발 - 다대포해수욕장 동쪽 끝",
      lat: 35.0440351,
      lng: 128.9670457
    },
    {
      label: "중간1 - 다대포해수욕장",
      lat: 35.0498351,
      lng: 128.9594366
    },
    {
      label: "중간2 - 다대포 길",
      lat: 35.0616740,
      lng: 128.9555313
    },
    {
      label: "도착 - 장림도시 가스삼거리",
      lat: 35.0784633,
      lng: 128.9512827
    }
  ]
},
{
  id: "eulsukdo",
  title: "🏃 을숙도 생태공원",
  distance: "약 5km",
  points: [
    {
      label: "출발 - 을숙도 철새공원",
      lat: 35.1006651,
      lng: 128.9458520
    },
    {
      label: "중간1 - 을숙도 철새공원 입구",
      lat: 35.1008318, 
      lng: 128.9419145
    },
    {
      label: "중간2 - 조류관찰소",
      lat: 35.0880768,
      lng: 128.9410884
    },
    {
      label: "도착 - 메모리얼파크",
      lat: 35.0964516,
      lng: 128.9458949
    }
  ]
}
];
